<HTML><head>
<title>W3Perl Greetings - FR</TITLE>
</head>

<BODY BACKGROUND="../img/bg.gif" TEXT="#000000" LINK="#0000C0" VLINK="50508F">

<TABLE BORDER=0 CELLSPACING=5 WIDTH=100%>
<TR>
<TD WIDTH=120 VALIGN=TOP><IMG SRC="../img/line.gif" WIDTH=110 HEIGHT=2></TD>
<TD VALIGN=TOP ALIGN=CENTER>
<FONT COLOR="#0000FF"><H1>Remerciements</H1></FONT>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<FONT SIZE=+2></FONT>
</TD>
<TD VALIGN=TOP>
<LI> Le site w3perl.com est maintenant ouvert et pr&ecirc;t &agrave; vous recevoir.<BR>
<I>Merci &agrave; <A HREF="http://www.futurequest.net/">Futurequest</A> pour forunir un h&eacute;bergement de qualit&eacute;.</I>
<P>
<LI> L'application a &eacute;t&eacute; principalement d&eacute;velopp&eacute; sur un Archimedes depuis Mars 95 jusqu'&agrave; Juillet 99.<BR>
<I>Merci &agrave; Acorn pour avoir produit des machines aussi merveilleuses !</I>
<P>

<LI> Les premiers tests ont &eacute;t&eacute; effectu&eacute;s &agrave; l'<A HREF="http://www.orstom.fr/">Orstom</A> en Mai 1995<BR>
<I>J'aimerais remercier tout particuli&egrave;remenent Marc LeBris qui
m'a permis de developper cette application et de la tester sur ce serveur.</I>
<P>
<LI> A cause de nombreuses proc&eacute;dure de s&eacute;curit&eacute; tr&egrave;s contraignantes, seules quelques am&eacute;liorations ont &eacute;t&eacute; possibles &agrave; <A HREF="http://www.grolier.fr/">Grolier Interactive</A>. La plupart du travail s'est effectu&eacute; sur mon Archimedes et
ensuite test&eacute; sur une station Unix avec des fichiers de log de basse
qualit&eacute;.
<P>
<LI> De grands pas ont &eacute;t&eacute; franchis &agrave; l'observatoire 
de Meudon sur le serveur de <A HREF="http://www.lyot.obspm.fr/">hplyot</A>.<BR>
<I>Un tr&egrave;s grand merci &agrave; Laurent Demailly qui m'a gentillement
permis d'avoir un compte sur cette machine et qui m'a appris de
nombreuses choses sur les myst&egrave;res d'Unix !</I>

<P>
Merci &eacute;galement &agrave; :

<UL>
<LI> <I>Alexandre Gefen</I> pour ses nombreux tests et d&eacute;buggages sur son serveur NT
<LI> <I>Jean Michel Augusto</I> pour de nombreuses parties de d&eacute;bggages ;) et de nombreuses am&eacute;liorations
<LI> <I>Ronald Offerman</I> pour le support sur le multi-langage et de nombreuses corrections d'anglais ;)
<LI> <I>Jean Louis Damez</I> pour ses premiers tests sur sa station NT et pour compiler le logiciel FLY sous NT.
<LI> <I>Martin Gleeson</I> pour son superbe outil graphique : <A HREF="http://www.unimelb.edu.au/fly/">fly</A>
<LI> <I>Laurent Demailly</I>  qui m'a ouvert un compte depuis plus de 4 ans sur sa machine.
<LI> <I>Jean-Luc Dalous</I> pour tester le logiciel.
<LI> <I>Hirohisa Ikuno</I> pour de petites corrections.
<LI> <I>Stephen Couchman</I> pour quelques heureuses suggestions.
<LI> <I>Daniel Chase</I> pour son aide et son support.
<LI> <I>Rob. Hartill</I> qui m'a donn&eacute; l'id&eacute;e d'&eacute;crire un logiciel de stats.
<LI> et toutes les personnes qui m'ont aid&eacute; par leurs remerciements et
leurs enthousiasmes.
</UL>
<P>
Les traductions ont &eacute;t&eacute; effectu&eacute;es par :
<UL>
<LI> Hollandais : Ron Offerman
<LI> Japonais : Ikuno Hirohisa et Pascal Ferreira
<LI> Italien : Marc Cabassa
<LI> Espagnol : www.ccoo.es
</UL>

</TD>
</TR>
<TR>
<TD WIDTH=120></TD>
<TD ALIGN=CENTER>
<A HREF="/chinaeoa/index.jsp"><IMG border=0 SRC="../img/back.gif" WIDTH=67 HEIGHT=39 ALT="back"></A>
</TD>
</TR>
</TABLE>

</body>
</html>