<HTML><head>
<title>W3Perl History - FR</TITLE>
</head>

<BODY BACKGROUND="../img/bg.gif" TEXT="#000000" LINK="#0000C0" VLINK="50508F">

<TABLE BORDER=0 CELLSPACING=5 WIDTH=100%>
<TR>
<TD WIDTH=120 VALIGN=TOP><IMG SRC="../img/line.gif" WIDTH=110 HEIGHT=2></TD>
<TD VALIGN=TOP ALIGN=CENTER>
<FONT COLOR="#0000FF"><H1>Evolution de l'application</H1></FONT>
</TD>
</TR>

<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
 <img src="../img/new.gif" width=35 height=12 ALT="new"><br>
   Version 2.40<br>
   27th Jun 1998
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
Graphes pour certains pages pr&eacute;s&eacute;lectionn&eacute;es<BR>
Installation sous NT simplifi&eacute;e<BR>
Toutes les stats peuvent &ecirc;tre lanc&eacute;es par un lien dans une page HTML<BR>
Proc&eacute;dures d'installation mises &agrave; jour<BR>
Stats sur la taille des r&eacute;pertoires (shareware uniquement)<BR>
Interface d'administration am&eacute;lior&eacute;e.<BR>
Stats sur les pages am&eacute;lior&eacute;es.<BR>
Plus aucun liens en absolu dans w3perl.<BR>
Les liens externes peuvent &ecirc;tre v&eacute;rifi&eacute;s (shareware uniquement)<BR>
Les scripts peuvent &ecirc;tre ex&eacute;cut&eacute;s par l'interm&eacute;diaire d'une page HTML<BR>
Ajout de la possibilit&eacute; de filtrer les serveurs virtuels pour le NECLF<BR>
Support pour la compression zip<BR>
Support pour les fichiers de log compress&eacute; quotidiennement<BR>
Nom de fichier de log param&eacute;trable<BR>
<P>
<hr width=50%>
<P>
</TD>
</TR>

<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 2.30<br>
   26th Mar 1998
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
Stats sur les fichiers de log avec serveurs virtuels (NECLF)<BR>
Premi&egrave;re version de l'interface d'administration<BR>
www.w3perl.com en cours de construction ;)<BR>
V&eacute;rification du code HTML am&eacute;lior&eacute;e (forms et imagemap)<BR>
Possibilit&eacute; de calculer des stats sur plusieurs ann&eacute;es (maximum 10)<BR>
Nombre de sites par pays disponoble.<BR>
Stats sur les erreurs possibles sur NT si vous utilisez des fichiers de
redirection d'erreur<BR>
Traduction d'URL et l'arborescence fonctionnent sous NT<BR>
Mise &agrave; jour de la homepage<BR>
Mise &agrave; jour des stats sur les fureteurs et les r&eacute;f&eacute;rences<BR>
Support pour les fichiers de log IIS 4.0 et IIS 3.0 modifi&eacute;.<BR>
Possibilit&eacute; d'avoir les frames : haut-bas ou droite-gauche<BR>
Support pour les serveurs Lotus ajout&eacute; (Domino).<BR>
Traduction des codes de pays<BR>
Vision plus pr&eacute;cise de stats sur les pays<BR>
Stats sur les r&eacute;pertoires avec un niveau ou r&eacute;cursif.<BR>
<P>
<hr width=50%>
<P>
</TD>
</TR>


<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 2.20<br>
   18th Dec 1997
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
 Test&eacute; enti&egrave;rement sur un serveur NT 4.0 grace &agrave; Alexandre Gefen.<BR>
 Ajout du nouveau format d'erreur d'Apache 1.3b<BR>
 Fonctionne avec des fichiers de log IIS (serveur NT) et avec le NECLF<BR>
 Stats sur les scripts (m&eacute;thode POST et GET)<BR>
 Stats pour les acc&egrave;s sur des r&eacute;pertoires prot&eacute;g&eacute;s<BR>
 Stats locales uniquement possibles<BR>
 Possibilit&eacute; de stats s&eacute;lectives sur les sessions et les documents de votre site web<BR>
 Possibilt&eacute; de ne rechercher que les nbdays pr&eacute;c&eacute;dents jours (-d) dans cron-pages et cron-session<BR>
 Les lignes de commandes ont chang&eacute;<BR>
 Comptage des proxy<BR>
 Cr&eacute;tion d'un fichier d'history pour connaitre la vitesse des scripts de w3perl<BR>
 Nouvelles options disponibles dans cron-w3perl (u : reset, a : initialise)<BR>
 Nombreux bugs fix&eacute;s (mode compress&eacute; et mode reverse dns)<BR>
<P>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 2.10<br>
   12th Sep 1997
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
   Version Japonaise et italienne<BR>
   Algorithme r&eacute;&eacute;crit pour cron-url. Meilleure et plus rapide<BR>
   Stats sur les erreurs, les fureteurs et les r&eacute;f&eacute;rences fonctionnent avec des fichiers compress&eacute;s<BR>
   Un seul script pour lancer toutes les stats via la crontab (cron-w3perl.pl)<BR>
   Option de Reverse DNS disponible<BR>
   Une mailing list est ouverte<BR>
   Meilleure gestion des dates et bugs corrig&eacute;s dans les sessions<BR>
   W3Perl fonctionne correctement sur un serveur Mac :)<BR>
   Stats sur une p&eacute;riode donn&eacute;e possible par la ligne de commande<BR>
   Les liens sur les maps sont v&eacute;rifi&eacute;s via cron-url <BR>
   V&eacute;rification des liens sur des /chinaeoa/index.jsp pour une utilisation locale ou sur CD-ROM<BR>
   Session and Document ont une nouvelle homepage avec icones<BR>
   Ajout des mots cl&eacute;s issus des moteurs de recherche<BR>
<P>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 2.00<br>
   26th Jun 1997
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
   Version espagnole et hollandaise<BR>
   Mode incr&eacute;mentale pour les r&eacute;f&eacute;rences, les fureteurs et les statistiques sur les erreurs<BR>
   Stats sur les erreurs tri&eacute;s par date<BR>
   Mode incr&eacute;mental fonctionne en $precision = 4<BR>
   Stats sur les domaines ajout&eacute;es<BR>
   V&eacute;rification des WIDTH, HEIGHT et ALT tag (shareware uniquement)<BR>
   Pages inutiles (pages sans appels de liens) (shareware uniquement)<BR>
   Le poids des pages HTML inclus maintenant le poids des images<BR>
   Nouvelle homepage avec des icones<BR>
   Explorer cach&eacute; dans le comptage de Netscape : fix&eacute;.<BR>
   Fonctionne sur tous types d'ordinateurs (Mac, PC, NT, Unix...)<BR> 
   Support pour de multiples fichiers de log ajout&eacute;. Installation unique par machine et non pas par serveur<BR>
   Support pour le multi-langage ajout&eacute;<BR>
<P>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 1.90<br>
   21th Jan 1997
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
   V&eacute;rification des liens vers les scripts.<BR>
   Nombreux petits bugs fix&eacute;s<BR>
   Am&eacute;lioration de la d&eacute;tection des mauvais liens et des mauvais fichiers<BR>
   Graphes sur le nombre de session par jours ajout&eacute;<BR>
   D&eacute;tection automatique du mode incr&eacutemntal pour les stats mensuelles<BR>
   Stats sur les fureteurs et les erreurs pour le serveur de Netscape ajout&eacute;es<BR> 
   Redirection 2>&1 dans la crontab d&eacute;sormais inutile<BR>
   Les noms des scripts sont en anglais maintenant :) <BR>
<P>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 1.80<br>
   28th Oct 1996
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
   Session sur les robots (shareware uniquement).<BR>
   Graphes possibles en 3D et en lignes remplies.<BR>
   V&eacute;rification des liens (shareware uniquement).<BR>
   Arborescence de votre site Web (shareware uniquement).<BR>
   Stats mensuelles en incr&eacute;mental.<BR>
   Nouveau script checkconf.pl pour ... v&eacute;rifier votre fichier config.pl !.<BR>
   Meilleur graphique pour les sous-r&eacute;pertoires par jours.<BR>
   Graphes sur les erreurs et les fureteurs par rapport au temps (extended NCSA log uniquement).<BR>
   W3Perl est d&eacute;sormais Shareware.<BR>
   Bugs fix&eacute;s.<BR>
   Documentation mise &agrave; jour.<BR>
<P>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 1.70<br>
   2nd Aug 1996
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
   Am&eacute;lioration de la vitesse en incr&eacute;mental et pour les stats sur les heures.<BR>
   Option pour exclure les r&eacute;pertoire priv&eacute;s.<BR>
   Support pour le Extended common logfile support ajout&eacute; (NCSA httpd > 1.4)<BR>
   Camembert pour le traffic par pays.<BR>
   Stats sur les r&eacute;pertoires et les pages HTML am&eacute;lior&eacute;es.<BR>
   Meilleure gestion de l'axe horizontal pour les graphes.<BR>
   Lignes de commandes disponibles.<BR>
   Stats sur les erreurs et les sessions ajout&eacute;es.<BR>
<P>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 1.60<br>
   10th&nbsp;May&nbsp;1996
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
   Installation simplifi&eacute;e avec un nouveau outil graphique de Marten Gleeson.<br>
   Am&eacute;lioration de la version incr&eacute;mentale qui peut calculer sur plusieurs jours.<br>
   Meilleur gestion de la m&eacute;moire (et de la vitesse).<br> 
   Stats optionelles sur les pages HTML de votre serveur (taille, liens, images...).<br>
<P>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 1.50<br>
   7th Mar 1996
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
   Ajout de cron-url.pl pour convertir les URL en titre du document HTML.<br>
   Utilisation de frame (Netscape2) pour la navigation.<br>
   Les acc&egrave;es HTML sont d&eacute;sormais calcul&eacute;s.<br> 
   Enregistrement n&eacute;cessaire pour connaitre qui utilise mon application.
<P>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 1.40<br>
   28th Jan 1996
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
<P>
   Ajout d'un script incr&eacute;mental. Am&eacute;lioration consid&eacute;rable de la vitesse de calcul<BR> Fonctionne uniquement en pr&eacute;cision de 1 &agrave; 3.<BR>
<P><BR><BR>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 1.30<br>
   26th Dec 1995
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
<P>
   Vitesse de calcul augment&eacute;e. Ajout des stats sur les r&eacute;f&eacute;rences et les fureteurs.
<P><BR><BR>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 1.20<br>
   11th Dec 1995
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
<P>
   Ajout de graphes et de tables. Stats sur les r&eacute;pertoires
<P><BR><BR>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 1.10<br>
   28th Nov 1995
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
<P>
   Quelques bugs fix&eacute;s. Documentation au format HTML et meilleure script d'installation
<P><BR>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 1.00<br>
   3rd Nov 1995
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
<P>
   Premi&egrave;re mise &agrave; disposition du logiciel sur le Net
<P><BR><BR>
<hr width=50%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<TABLE BORDER=1>
<TR>
<TH ALIGN=CENTER>
   Version 0.00<br>
   7th Feb 1995
   </TH>
   </TR>
   </TABLE>
</TD>
<TD VALIGN=TOP>
<P>
   Conversion de mon premier script de stats du csh vers Perl
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120></TD>
<TD ALIGN=CENTER>
<A HREF="/chinaeoa/index.jsp"><IMG border=0 SRC="../img/back.gif" WIDTH=67 HEIGHT=39 ALT="back"></A>
</TD>
</TR>
</TABLE>
</body>
</html>