<HTML><head>
<title>W3Perl Setiware - FR</TITLE>
</head>

<BODY BACKGROUND="../img/bg.gif" TEXT="#000000" LINK="#0000C0" VLINK="50508F">

<TABLE BORDER=0 CELLSPACING=5 WIDTH=100%>
<TR>
<TD WIDTH=120 VALIGN=TOP><IMG SRC="../img/line.gif" WIDTH=110 HEIGHT=2></TD>
<TD VALIGN=TOP ALIGN=CENTER>
<FONT COLOR="#0000FF"><H1>Setiware</H1></FONT>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<I><FONT SIZE=+1>Introduction</FONT></I>
</TD>
<TD VALIGN=TOP>
Que signifie le terme 'setiware' ?<BR>
Lorsque vous avez pass&eacute; de longues nuits et des laborieux week-end &agrave;
travailler sur un outil comme celui-ci, il est courant de le mettre &agrave;
disposition de la communaut&eacute; sous une licence shareware. Mais plutot
que de r&eacute;clamer de l'argent, je prefererai recevoir des unit&eacute;s
Seti@Home car je suis un v&eacute;ritable chasseur d'E.T ;)
<BR>
<A HREF="http://setiathome.ssl.berkeley.edu/">SETI@home</A> est un 
programme scientifique qui utilise la puissance combin&eacute;e des 
diff&eacute;rents ordinateurs sur le Net dans le but de la recherche
d'intelligence extra-terrestre (SETI en anglais). Chacun est libre
d'apporter sa contribution en utilisant un programme gratuit qui 
t&eacute;l&eacute;charge puis analyse des blocs de donn&eacute;es issus
des &eacute;coutes du radiot&eacute;lescopes de Arecibo. Une fois
trait&eacute; par votre ordinateur, le bloc de donn&eacute; est retourn&eacute;
 et vous &ecirc;tes cr&eacute;dit&eacute; d'une unit&eacute;. Plus vous
avez de cr&eacute;dits, plus vous avez travailler pour la recherche
de civilisations extraterrestres. Etant un passionn&eacute; d'astronomie,
je suis toujours &agrave; la recherche de davantage de puissance de calculs.
Donc quelques unit&eacute;s Seti contre l'utilisation illimit&eacute;e de
ce programme me semble un juste arrangement. Bien sur, vous n'&ecirc;tes pas
oblig&eacute; de le faire (comme je ne suis pas oblig&eacute; de donner
libre acces &agrave; ce programme) mais ce serait sympa de votre part.
Il vous suffit de t&eacute;l&eacute;charger le programme sur le site de
Seti@Home et de vous enregistrer en tant qu'utilisateur d&eacute;j&agrave;
existant sous mon adresse email domisse@w3perl.com
</TD>
</TR>
<TD WIDTH=120></TD>
<TD><P><HR ALIGN=CENTER WIDTH=30%><P></TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<I><FONT SIZE=+1>Condition d'utilisation</FONT></I>
</TD>
<TD VALIGN=TOP>
La version enregistr&eacute;e de w3perl est <B>SETIWARE</B>.<BR>
<BR>
Cela signifie que vous pouvez utiliser ce programme aussi longtemps que vous
le d&eacute;sirez mais qu'en &eacute;change une petite contribution est 
la bienvenue. Vous pouvez :
<UL>
<LI> m'aider &agrave; promouvoir ce logiciel en y ajoutant un lien depuis votre site.
<LI> contribuer au paiement de mon acc&egrave;s Internet (300 F est une somme appr&eacute;ci&eacute;e ;)
<LI> m'envoyer une carte postale (sauf si vous habitez Paris !) 
<LI> traiter des unit&eacute;s Seti@Home en mon nom.
<P>
</UL>
Si vous choisissez une de ces options, je serai heureux de vous
compter parmi mes utilisateurs enregistr&eacute;s. Cela vous
permet de recevoir des mises &agrave; jour du logiciel, de me
sugg&eacute;rer des am&eacute;liorations que vous aimeriez voir
ou tout simplement de vous aider en cas de probl&egrave;me.
<BR>
Si vous utilisez actuellement cette version de w3perl, c'est grace &agrave; l'aide
de certaines personnes qui m'ont encourag&eacute; a poursuivre en m'envoyant une licence.

<P>
</TD>
</TR>
<TR>
<TD WIDTH=120></TD>
<TD><P><HR ALIGN=CENTER WIDTH=30%><P></TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<I><FONT SIZE=+1>Greetings</FONT></I>
</TD>
<TD VALIGN=TOP>
Je voudrais remercier mes premiers utilisateurs Setiware :
<UL>
<LI> Pierre Le Sidaner : <A HREF="http://www.inrp.fr/" TARGET="_top">www.inrp.fr</A>
<LI> Laurinda Chamberlin : <A HREF="http://www.fujitsu.com/" TARGET="_top">www.fujitsu.com</A>
</UL>
</TD>
</TR>
<TR>
<TD WIDTH=120></TD>
<TD><P><HR ALIGN=CENTER WIDTH=30%><P></TD>
</TR>
<TR>
<TD WIDTH=120></TD>
<TD><P><HR ALIGN=CENTER WIDTH=30%><P></TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP>
<I><FONT SIZE=+1>Contacter l'auteur</FONT></I>
</TD>
<TD VALIGN=TOP>
Les probl&egrave;mes rencontr&eacute;s lors de l'utilisation du logiciel, 
les commentaires et les enregistrements sont &agrave; envoyer &agrave;
cette adresse :

<UL><UL>
             Laurent DOMISSE <BR>
             33-35, rue Louis Morard<BR>
             75014 Paris <BR>
             France<BR>
</UL></UL>

Je peux &eacute;galement &ecirc;tre joint par email : <A HREF="mailto:domisse@w3perl.com">domisse@w3perl.com</A>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120></TD>
<TD ALIGN=CENTER>
<A HREF="/chinaeoa/index.jsp"><IMG border=0 SRC="../img/back.gif" WIDTH=67 HEIGHT=39 ALT="back"></A>
</TD>
</TR>
</TABLE>
</body>
</html>

