<HTML><head>
<title>W3Perl Webmaster installation - FR</TITLE>
</head>

<BODY BACKGROUND="../img/bg.gif" TEXT="#000000" LINK="#0000C0" VLINK="50508F">

<TABLE WIDTH=100% CELLSPACING=5 BORDER=0>
<TR>
<TD WIDTH=120 VALIGN=TOP><IMG SRC="../img/line.gif" WIDTH=110 HEIGHT=2></TD>
<TD VALIGN=TOP>
<CENTER>
<FONT COLOR="#0000FF"><H1>Installation par un webmaster</H1></FONT>
<P>
</CENTER>
<P>
<BR>
<BR>
Pas de restriction &agrave; ce niveau car vous avez le controle complet sur votre
serveur ! Les scripts peuvent &ecirc;tre tout aussi bien &ecirc;tre install&eacute;s
dans votre r&eacute;pertoire cgi-bin ou au niveau de l'arborescence de votre
site Web. La premi&egrave;re solution &eacute;tant tout de m&ecirc;me plus conseill&eacute;e.

<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP ALIGN=CENTER>
<I><FONT SIZE=+1><B>R&eacute;pertoire <BR>cgi-bin</B></FONT><HR width=50%></I>
</TD>
<TD VALIGN=TOP>
1.1 - T&eacute;l&eacute;chargez l'application <A HREF="http://www.w3perl.com/download//chinaeoa/index.jsp">W3Perl</A> 
sur votre serveur. Placez l&agrave; au niveau de la racine de votre serveur Web.
<P>
1.2 - D&eacute;compressez l'application et d&eacute;sarchivez les fichiers. Cela va cr&eacute;er un
r&eacute;pertoire /w3perl/ au sein de votre arborescence. Ce r&eacute;pertoire sera nomm&eacute;
DIR_STAT par la suite. (Vous pouvez changer le nom de ce r&eacute;pertoire &agrave; votre convenance).
<P>
1.3 - Donnez les permissions d'ex&eacute;cution aux scripts (chmod +x *.pl) [Unix uniquement]
<P>
1.4 - Editez le fichier fixperlpath.pl pour refl&eacute;ter l'endroit o&ugrave; se trouve l'ex&eacute;cutable
Perl sur la machine de <I><B>votre h&eacute;bergeur</B></I> (la plupart utilise /usr/local/bin/perl). 
Les sites Web h&eacute;berg&eacute;s sous NT devront &eacute;galement modifier la deuxi&egrave;me ligne
de fixperlpath.pl pour rendre compte de l'endroit o&ugrave; se trouvera situ&eacute; le fichier libw3perl.pl
dans le r&eacute;pertoire cgi-bin sur la machine de votre h&eacute;bergeur.
Les sites sous Unix et NT devront modifi&eacute; la troisi&egrave;me ligne afin de refl&eacute;ter l'endroit
de votre r&eacute;pertoire de statistiques (DIR_STAT) sur la machine de votre h&eacute;bergeur.
<P>
1.5 - Cr&eacute;ez un sous r&eacute;pertoire w3perl au sein de votre r&eacute;pertoire cgi-bin.
D&eacute;placez tous les scripts depuis /DIR_STAT/ vers ce sous-r&eacute;pertoire et ajoutez y
aussi les scripts que vous trouverez dans /DIR_STAT/cgi-bin/w3perl/. 
Si vous ne pouvez pas cr&eacute;er de sous r&eacute;pertoire au sein de votre r&eacute;pertoire
cgi-bin, vous devrez alors modifier tous les liens des fichiers /DIR_STAT/admin/.
<P>
1.6 - Utilisez votre fureteur pr&eacute;f&eacute;r&eacute; et allez sur l'URL suivante 
www.votresiteweb.com/DIR_STAT/admin/ o&ugrave; www.votresiteweb.com est l'adresse de votre site web.
L'interface d'administration de w3perl devrait alors apparaitre. 
<P>
1.7 - S&eacute;lectionnez ''Customization'
dans la section 'W3Perl Launch' qui va mettre &agrave; jour les chemins dans tous les scripts.
Une autre mani&egrave;re d'effectuer cette op&eacute;ration est de lancer fixperlpath.pl depuis
votre r&eacute;pertoire 
<P>
1.8 - Maintenant un petit retour en arri&egrave;re et s&eacute;lectionnez 'Make configuration file'
et remplissez les diff&eacute;rents formulaires. Vous devrez apparavant avoir d&eacute;placer le
fichier config.pl vers un autre nom de fichier sinon les formulaires vous avertirons de la 
pr&eacute;sence actuelle d'un fichier de configuration.
<P>
1.9 - C'est termin&eacute; ! Il ne reste plus qu'&agrave; lancer les scripts.
<BR>
 - Si vous &ecirc;tes s&ucirc;r de vos choix, les sites sous Unix peuvent s&eacute;lectionner 
'Initialization' qui va lancer tous les scripts de stats automatiquement.
(soyez patient si votre fichier de log est tr&egrave;s gros et/ou la machine est lente ou 
utilisez un fichier de log restreint de plus petite taille pour un premier test).
Les sites sous NT devront lancer les scripts un par un dans la section 'First use', 
s&eacute;lectionnez en premier lieu 'Documents stats', puis 'Main stats' et finalement
tous les autres.<BR>
Des messages seront affich&eacute;s vous permettant ainsi de suivre les diff&eacute;rentes parties
des calculs. Si une erreur survient, v&eacute;rifiez votre fichier de configuration ou si rien
n'est affich&eacute;, t&eacute;l&eacute;chargez le fichier error_log pour examiner ce qui ne va pas.
<P>
- Si vous pr&eacute;f&eacute;rez d'abord test&eacute; les options que vous avez choisies,
s&eacute;electionnez cron-hour.pl dans l'interface d'administration. Si la sortie vous
plait, vous pouvez alors lancer cron-pages.pl qui va initialiser les premi&egrave;res statistiques.
(soyez patient si votre fichier de log est tr&egrave;s gros et/ou la machine est lente ou 
utilisez un fichier de log restreint de plus petite taille pour un premier test).
Il est toujours possible de lancer les scripts via la ligne de commande &eacute;galement pour
voir les messages internes apparaitre au fur et &agrave; mesure.
<P>
1.10 - Si tout est ok, editez le fichier cron-w3perl.pl, choississez quand vous d&eacute;sirez
lancer les diff&eacute;rents scripts et finalement ajoutez ce script dans votre crontab.
Si vous le lancez en ligne de commande avec l'option -a, cron-w3perl.pl va calculer toutes les
statistiques pour vous d'un seul coup.
<P>
<HR ALIGN=CENTER WIDTH=30%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP ALIGN=CENTER>
<I><FONT SIZE=+1><B>R&eacute;pertoire <BR>du serveur</B></FONT><HR width=50%></I>
</TD>
<TD VALIGN=TOP>
<P>
Les scripts peuvent &ecirc;tre install&eacute;s au niveau de la racine de votre
serveur Web &agrave; la place du r&eacute;pertoire cgi-bin. Mais pour pouvoir utiliser
l'interface d'adminstration &agrave; distance, il vous sera n&eacute;cessaire de d&eacute;placer
les scripts de /DIR_STAT/cgi-bin/w3perl/ vers votre r&eacute;pertoire /cgi-bin/w3perl/.
<BR>
Il s'agit d'une possibilit&eacute; offerte aux personnes ne disposant pas de r&eacute;pertoire
cgi-bin par d&eacute;faut mais cela n'est pas tr&egrave;s utile pour une installation par
un webmaster !
<P>
<HR ALIGN=CENTER WIDTH=30%>
<P>
</TD>
</TR>
<TR>
<TD WIDTH=120 VALIGN=TOP ALIGN=CENTER>
<I><FONT SIZE=+1><B>Conseil</B></FONT><HR width=50%></I>
</TD>
<TD VALIGN=TOP>
1 - Lisez avec attention la documentation. De nombreuses questions sont r&eacute;solues, utilisez
&eacute;galement l'option -h pour plus d'informations au niveau de chaque script.
<P>
2 - Les sites sous NT ne peuvent pas utiliser cron-w3perl.pl car NT est incapable 
de forker des processes. Mais la commande 'at' peut faire office de lancement automatique.
<P>
3 - Vous pouvez cr&eacute;er autant de fichiers de confguration que vous le souhaitez. Utilisez 
l'option -c pour les charger. Inutile donc d'installer l'application plusieurs fois.
<P>
4 - N'oubliez pas que de nombreuses options sont disponibles via les
lignes de commande pour chaque script.
<P>
5 - Installez un mot de passe au niveau du r&eacute;pertoire  /DIR_STAT/admin/ afin
d'&eacute;viter que tout le monde puisse changer votre configuration.
</TD>
</TR>
<TR>
<TD WIDTH=120></TD>
<TD ALIGN=CENTER>
<A HREF="install.html"><IMG border=0 SRC="../img/back.gif" WIDTH=67 HEIGHT=39 ALT="back"></A>
</TD>
</TR>
</TABLE>
</body>
</html>