<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<!-- saved from url=(0041)http://192.168.0.10/cnh_backend/top15.htm -->
<!-- saved from url=(0031)http://bst.cig.com.cn/top15.htm --><HTML><HEAD><TITLE>Untitled Document</TITLE>
<STYLE type=text/css>.font9 {
	COLOR: #ff8000; FONT-SIZE: 9pt; FONT-WEIGHT: normal
}
.font12 {
	COLOR: #ff8000; FONT-SIZE: 12pt; FONT-WEIGHT: bold
}
</STYLE>

<META content="text/html; charset=gb2312" http-equiv=Content-Type>
<SCRIPT language=javascript>
<!-- hide jscript from old browsers ---
var data = new Array
("安徽　　　|1|,*澳门　　　|2|,*北京　　　|3|,*福建　　　|4|,*甘肃　　　|5|,*广东　　　|6|,*广西　　　|7|,*贵州　　　|8|,*海南　　　|9|,*河北　　　|10|,*河南　　　|11|,*黑龙江　　|12|,*湖北　　　|13|,*湖南　　　|14|,*吉林　　　|15|,*江苏　　　|16|,*江西　　　|17|,*辽宁　　　|18|,*内蒙古　　|19|,*山东　　　|20|,*山西　　　|21|,*陕西　　　|22|,*上海　　　|23|,*四川　　　|24|,*天津　　　|25|,*西藏　　　|26|,*香港　　　|27|,*新疆　　　|28|,*云南　　　|29|,*浙江　　　|30|,*重庆　　　|31|,",
"合肥　　　　　　　|1|,1,*石家庄　　　　　　|32|,10,*保定　　　　　　　|133|,10,*秦皇岛　　　　　　|135|,10,*洛阳　　　　　　　|33|,11,*郑州　　　　　　　|34|,11,*哈尔滨　　　　　　|35|,12,*武汉　　　　　　　|36|,13,*长沙　　　　　　　|37|,14,*长春　　　　　　　|38|,15,*常州　　　　　　　|39|,16,*无锡　　　　　　　|43|,16,*苏州　　　　　　　|42|,16,*南京　　　　　　　|41|,16,*连云港　　　　　　|40|,16,*南昌　　　　　　　|44|,17,*大连　　　　　　　|45|,18,*丹东　　　　　　　|46|,18,*沈阳　　　　　　　|47|,18,*呼和浩特　　　　　|48|,19,*澳门　　　　　　　|2|,2,*济南　　　　　　　|49|,20,*青岛　　　　　　　|50|,20,*烟台　　　　　　　|51|,20,*太原　　　　　　　|52|,21,*西安　　　　　　　|53|,22,*上海　　　　　　　|54|,23,*成都　　　　　　　|55|,24,*天津　　　　　　　|56|,25,*拉萨　　　　　　　|57|,26,*香港　　　　　　　|58|,27,*乌鲁木齐　　　　　|59|,28,*昆明　　　　　　　|60|,29,*北京　　　　　　　|3|,3,*杭州　　　　　　　|61|,30,*余杭　　　　　　　|136|,30,*宁波　　　　　　　|62|,30,*温州　　　　　　　|63|,30,*重庆　　　　　　　|64|,31,*福州　　　　　　　|4|,4,*武夷山　　　　　　|5|,4,*厦门　　　　　　　|6|,4,*敦煌　　　　　　　|7|,5,*兰州　　　　　　　|8|,5,*东莞　　　　　　　|9|,6,*番禺　　　　　　　|10|,6,*佛山　　　　　　　|11|,6,*广州　　　　　　　|12|,6,*鹤山　　　　　　　|13|,6,*惠州　　　　　　　|14|,6,*江门　　　　　　　|15|,6,*梅州　　　　　　　|16|,6,*汕头　　　　　　　|17|,6,*潮州　　　　　　　|134|,6,*深圳　　　　　　　|18|,6,*顺德　　　　　　　|19|,6,*台山　　　　　　　|20|,6,*湛江　　　　　　　|21|,6,*肇庆　　　　　　　|22|,6,*中山　　　　　　　|23|,6,*珠海　　　　　　　|24|,6,*北海　　　　　　　|25|,7,*桂林　　　　　　　|26|,7,*南宁　　　　　　　|27|,7,*贵阳　　　　　　　|28|,8,*海口　　　　　　　|29|,9,*三亚　　　　　　　|30|,9,*兴隆　　　　　　　|31|,9,",
"古井假日酒店　　　　　　|382|,1,*诺富特酒店　　　　　　　|383|,1,*华侨饭店　　　　　　　　|384|,1,*卢阳饭店　　　　　　　　|385|,1,*安徽饭店　　　　　　　　|381|,1,*美丽华大酒店　　　　　　|443|,10,*番禺宾馆　　　　　　　　|441|,10,*广州宾馆　　　　　　　　|442|,10,*祈福（南沙）酒店　　　　|944|,10,*禅城酒店　　　　　　　　|401|,11,*金湖酒店　　　　　　　　|929|,11,*金湖酒店　　　　　　　　|930|,11,*金湖酒店　　　　　　　　|931|,11,*鸿运酒店　　　　　　　　|869|,11,*旋宫酒店　　　　　　　　|932|,11,*佛山宾馆　　　　　　　　|400|,11,*西部大酒店　　　　　　　|788|,12,*总统大酒店　　　　　　　|781|,12,*东风大酒店　　　　　　　|782|,12,*招商宾馆　　　　　　　　|780|,12,*粤海大厦　　　　　　　　|776|,12,*艺星大厦　　　　　　　　|775|,12,*华南大酒店　　　　　　　|787|,12,*东海大厦　　　　　　　　|783|,12,*越秀天安大厦　　　　　　|778|,12,*丽都大酒店　　　　　　　|763|,12,*神州酒店　　　　　　　　|768|,12,*香江宾馆　　　　　　　　|773|,12,*新大地宾馆　　　　　　　|772|,12,*天龙大酒店　　　　　　　|771|,12,*天河大厦　　　　　　　　|770|,12,*胜利宾馆　　　　　　　　|769|,12,*鑫浩大酒店　　　　　　　|774|,12,*云山大酒店　　　　　　　|779|,12,*黄花岗国际酒店　　　　　|759|,12,*皇都酒店　　　　　　　　|758|,12,*华泰宾馆　　　　　　　　|757|,12,*华侨友谊酒店　　　　　　|756|,12,*华茂中心　　　　　　　　|755|,12,*全球通大酒店　　　　　　|766|,12,*民航酒店　　　　　　　　|765|,12,*金桥宾馆　　　　　　　　|762|,12,*流花宾馆　　　　　　　　|764|,12,*景星酒店　　　　　　　　|739|,12,*江南大酒店　　　　　　　|737|,12,*凯旋华美达酒店　　　　　|740|,12,*文化假日酒店　　　　　　|741|,12,*中央酒店　　　　　　　　|743|,12,*爱群大酒店　　　　　　　|744|,12,*白云宾馆　　　　　　　　|745|,12,*富丽华大酒店　　　　　　|748|,12,*东山宾馆　　　　　　　　|747|,12,*广东国际大酒店　　　　　|725|,12,*广信江湾大酒店　　　　　|733|,12,*广东大厦　　　　　　　　|731|,12,*市长大厦　　　　　　　　|729|,12,*广州大厦　　　　　　　　|734|,12,*华厦大酒店　　　　　　　|735|,12,*嘉应宾馆　　　　　　　　|736|,12,*湖滨宾馆　　　　　　　　|753|,12,*广州宾馆　　　　　　　　|749|,12,*红棉大酒店　　　　　　　|752|,12,*豪景酒店　　　　　　　　|751|,12,*海涛酒店　　　　　　　　|750|,12,*金城宾馆　　　　　　　　|761|,12,*白云国际机场宾馆　　　　|760|,12,*湖天宾馆　　　　　　　　|754|,12,*东方丝绸大厦　　　　　　|746|,12,*粤新大酒店　　　　　　　|777|,12,*远洋大厦　　　　　　　　|910|,12,*东方宾馆　　　　　　　　|724|,12,*广东外商活动中心　　　　|879|,12,*白天鹅宾馆　　　　　　　|723|,12,*鸣泉居　　　　　　　　　|727|,12,*日航酒店　　　　　　　　|767|,12,*国际金融大厦　　　　　　|738|,12,*广东迎宾馆　　　　　　　|732|,12,*花园酒店　　　　　　　　|726|,12,*中国大酒店　　　　　　　|730|,12,*远洋宾馆　　　　　　　　|742|,12,*华侨酒店　　　　　　　　|933|,12,*雁山大酒店　　　　　　　|399|,13,*中银大厦　　　　　　　　|941|,133,*白玉兰　　　　　　　　　|942|,134,*白玉兰大酒店　　　　　　|943|,134,*长城酒店　　　　　　　　|945|,135,*城市花园酒店　　　　　　|466|,136,*天悦大酒店　　　　　　　|403|,14,*西湖大酒店　　　　　　　|405|,14,*西湖宾馆　　　　　　　　|404|,14,*蓬江酒店　　　　　　　　|497|,15,*国顺酒店　　　　　　　　|496|,15,*丽宫酒店　　　　　　　　|494|,15,*银晶酒店　　　　　　　　|495|,15,*望江楼大酒店　　　　　　|530|,16,*华侨大厦　　　　　　　　|531|,16,*华侨大厦　　　　　　　　|557|,17,*海景酒店　　　　　　　　|554|,17,*花园酒店　　　　　　　　|556|,17,*金海湾大酒店　　　　　　|552|,17,*帝濠酒店　　　　　　　　|551|,17,*国际大酒店　　　　　　　|553|,17,*龙湖宾馆　　　　　　　　|555|,17,*锦苑酒店　　　　　　　　|721|,18,*凯利宾馆　　　　　　　　|722|,18,*远东大酒店　　　　　　　|716|,18,*芙蓉宾馆　　　　　　　　|719|,18,*中南国际大酒店　　　　　|718|,18,*银湖旅游中心　　　　　　|715|,18,*江南酒店　　　　　　　　|720|,18,*小梅沙大酒店　　　　　　|712|,18,*富临大酒店　　　　　　　|665|,18,*富苑酒店　　　　　　　　|666|,18,*青青世界　　　　　　　　|669|,18,*都之都大酒店　　　　　　|673|,18,*东湖酒店　　　　　　　　|672|,18,*国宾大酒店　　　　　　　|674|,18,*庐山酒店　　　　　　　　|677|,18,*景轩酒店　　　　　　　　|676|,18,*晶都大酒店　　　　　　　|675|,18,*明华国际会议中心　　　　|678|,18,*洲际酒店　　　　　　　　|684|,18,*新世纪酒店　　　　　　　|683|,18,*特区报业俱乐部　　　　　|681|,18,*双溪威大酒店　　　　　　|680|,18,*帝濠酒店　　　　　　　　|688|,18,*凯利莱酒店　　　　　　　|703|,18,*西丽大酒店　　　　　　　|710|,18,*文锦酒店　　　　　　　　|709|,18,*石岩湖度假村　　　　　　|708|,18,*罗湖大酒店　　　　　　　|706|,18,*深圳大酒店　　　　　　　|707|,18,*雅园宾馆　　　　　　　　|714|,18,*新园大酒店　　　　　　　|713|,18,*香蜜湖酒店　　　　　　　|711|,18,*迪富宾馆　　　　　　　　|912|,18,*长安大酒店　　　　　　　|911|,18,*香格里拉大酒店　　　　　|874|,18,*彭年酒店　　　　　　　　|891|,18,*深圳湾大酒店　　　　　　|679|,18,*粤海酒店　　　　　　　　|717|,18,*新都酒店　　　　　　　　|682|,18,*五洲宾馆　　　　　　　　|670|,18,*骏豪酒店　　　　　　　　|667|,18,*南海酒店　　　　　　　　|668|,18,*阳光酒店　　　　　　　　|671|,18,*航空大酒店　　　　　　　|696|,18,*海燕大酒店　　　　　　　|695|,18,*金碧酒店　　　　　　　　|701|,18,*华侨酒店　　　　　　　　|698|,18,*皇宫半岛酒店　　　　　　|700|,18,*华中国际大酒店　　　　　|699|,18,*丽都酒店　　　　　　　　|705|,18,*凯悦大酒店　　　　　　　|704|,18,*京鹏宾馆　　　　　　　　|702|,18,*边防大酒店　　　　　　　|685|,18,*大梅沙海滨度假村　　　　|687|,18,*长城大酒店　　　　　　　|686|,18,*格兰云天大酒店　　　　　|693|,18,*港龙大酒店　　　　　　　|692|,18,*东华假日大酒店　　　　　|690|,18,*富丽华酒店　　　　　　　|691|,18,*华都酒店　　　　　　　　|697|,18,*海景酒店　　　　　　　　|694|,18,*新世界万怡酒店　　　　　|587|,19,*华美达酒店　　　　　　　|581|,19,*仙泉酒店　　　　　　　　|582|,19,*南环酒店　　　　　　　　|586|,19,*凤城酒店　　　　　　　　|583|,19,*金澜轩酒店　　　　　　　|585|,19,*皇帝酒店　　　　　　　　|584|,19,*帝濠酒店　　　　　　　　|306|,2,*威斯登度假酒店　　　　　|284|,2,*新世纪酒店　　　　　　　|286|,2,*文华东方酒店　　　　　　|285|,2,*富豪酒店　　　　　　　　|287|,2,*京澳酒店　　　　　　　　|291|,2,*金域酒店　　　　　　　　|290|,2,*假日酒店　　　　　　　　|289|,2,*皇庭酒店　　　　　　　　|288|,2,*总统酒店　　　　　　　　|296|,2,*皇都酒店　　　　　　　　|280|,2,*濠景酒店　　　　　　　　|279|,2,*凯悦酒店　　　　　　　　|281|,2,*圣地牙哥酒店　　　　　　|283|,2,*葡京酒店　　　　　　　　|282|,2,*竹湾酒店　　　　　　　　|295|,2,*君怡酒店　　　　　　　　|292|,2,*中国酒店　　　　　　　　|294|,2,*南粤酒店　　　　　　　　|293|,2,*京都酒店　　　　　　　　|304|,2,*金湾酒店　　　　　　　　|303|,2,*环球酒店　　　　　　　　|301|,2,*财神酒店　　　　　　　　|297|,2,*新丽华酒店　　　　　　　|305|,2,*富华酒店　　　　　　　　|299|,2,*东望洋酒店　　　　　　　|298|,2,*园林酒店　　　　　　　　|588|,20,*美丽华酒店　　　　　　　|589|,20,*银海酒店　　　　　　　　|601|,21,*星湖大酒店　　　　　　　|602|,22,*皇朝酒店　　　　　　　　|603|,22,*富洲饭店　　　　　　　　|615|,23,*京华酒店　　　　　　　　|616|,23,*怡景假日酒店　　　　　　|614|,23,*国际酒店　　　　　　　　|613|,23,*富华酒店　　　　　　　　|612|,23,*园林大酒店　　　　　　　|379|,24,*国际金融度假村　　　　　|373|,24,*西北航空酒店　　　　　　|377|,24,*海湾大酒店　　　　　　　|363|,24,*怡景湾大酒店　　　　　　|365|,24,*银都酒店　　　　　　　　|366|,24,*珠海宾馆　　　　　　　　|367|,24,*华骏酒店　　　　　　　　|369|,24,*度假村酒店　　　　　　　|368|,24,*君悦来酒店　　　　　　　|370|,24,*拱北宾馆　　　　　　　　|372|,24,*步步高大酒店　　　　　　|371|,24,*石景山旅游中心　　　　　|364|,24,*岐关大酒店　　　　　　　|376|,24,*金怡酒店　　　　　　　　|375|,24,*云海大酒店　　　　　　　|380|,24,*粤海酒店　　　　　　　　|378|,24,*金叶酒店　　　　　　　　|374|,24,*中玉大酒店　　　　　　　|410|,25,*香格里拉大饭店　　　　　|409|,25,*富丽华酒店　　　　　　　|411|,25,*漓江酒店　　　　　　　　|245|,26,*温莎七星大酒店　　　　　|246|,26,*环球大酒店　　　　　　　|244|,26,*温莎桂山大酒店　　　　　|241|,26,*桂湖饭店　　　　　　　　|243|,26,*观光酒店　　　　　　　　|242|,26,*新城市酒店　　　　　　　|247|,26,*假日宾馆　　　　　　　　|240|,26,*榕湖饭店　　　　　　　　|935|,26,*帝苑酒店　　　　　　　　|238|,26,*大宇大饭店　　　　　　　|239|,26,*邕江宾馆　　　　　　　　|540|,27,*明园饭店　　　　　　　　|539|,27,*国际大酒店　　　　　　　|537|,27,*明园新都酒店　　　　　　|538|,27,*贵州大酒店　　　　　　　|407|,28,*神奇假日酒店　　　　　　|406|,28,*金筑大酒店　　　　　　　|408|,28,*望海国际大酒店　　　　　|331|,29,*奥斯罗克大酒店　　　　　|325|,29,*海南文华大酒店　　　　　|319|,29,*国际金融大酒店　　　　　|322|,29,*泰华酒店　　　　　　　　|323|,29,*新温泉国际大酒店　　　　|324|,29,*汇通大厦　　　　　　　　|330|,29,*华侨大厦　　　　　　　　|328|,29,*金龙温泉酒店　　　　　　|329|,29,*宝华海景酒店　　　　　　|326|,29,*环岛泰得大酒店　　　　　|320|,29,*金海岸罗顿大酒店　　　　|321|,29,*国际金融大厦　　　　　　|937|,29,*海口宾馆　　　　　　　　|327|,29,*重庆饭店　　　　　　　　|118|,3,*中土大厦　　　　　　　　|117|,3,*中彩大酒店　　　　　　　|114|,3,*圆山大酒店　　　　　　　|112|,3,*燕翔饭店　　　　　　　　|109|,3,*裕龙大酒店　　　　　　　|111|,3,*天兆大饭店　　　　　　　|105|,3,*皇苑大酒店　　　　　　　|80|,3,*华风宾馆　　　　　　　　|79|,3,*郡王府饭店　　　　　　　|89|,3,*金都假日酒店　　　　　　|84|,3,*京闽饭店　　　　　　　　|88|,3,*金叶大厦　　　　　　　　|87|,3,*金世纪大酒店　　　　　　|86|,3,*金朗美丽殿大酒店　　　　|85|,3,*凯迪克大酒店　　　　　　|90|,3,*城市宾馆　　　　　　　　|65|,3,*展览馆宾馆　　　　　　　|64|,3,*保利大厦　　　　　　　　|63|,3,*百乐酒店　　　　　　　　|62|,3,*崇文门饭店　　　　　　　|66|,3,*方舟宾馆　　　　　　　　|70|,3,*二十一世纪饭店　　　　　|69|,3,*华北大酒店　　　　　　　|77|,3,*格兰云天大酒店　　　　　|72|,3,*国都大饭店　　　　　　　|45|,3,*大观园酒店　　　　　　　|44|,3,*和平宾馆　　　　　　　　|46|,3,*建国饭店　　　　　　　　|47|,3,*凯莱大酒店　　　　　　　|48|,3,*民族饭店　　　　　　　　|50|,3,*首都大酒店　　　　　　　|49|,3,*西苑饭店　　　　　　　　|51|,3,*友谊宾馆　　　　　　　　|53|,3,*深圳大厦　　　　　　　　|925|,3,*名人国际　　　　　　　　|876|,3,*国宾酒店　　　　　　　　|922|,3,*翠宫饭店　　　　　　　　|921|,3,*海逸酒店　　　　　　　　|5|,3,*长城饭店　　　　　　　　|14|,3,*华美伦酒店　　　　　　　|877|,3,*贵宾楼饭店　　　　　　　|7|,3,*香格里拉饭店　　　　　　|17|,3,*京瑞大厦　　　　　　　　|888|,3,*王府饭店　　　　　　　　|19|,3,*皇家大饭店　　　　　　　|34|,3,*中国大饭店　　　　　　　|16|,3,*北京饭店　　　　　　　　|22|,3,*凯宾斯基饭店　　　　　　|15|,3,*国际艺苑皇冠饭店　　　　|12|,3,*钓鱼台国宾馆　　　　　　|11|,3,*长富宫饭店　　　　　　　|10|,3,*港澳中心瑞士酒店　　　　|9|,3,*华侨大厦　　　　　　　　|8|,3,*国贸饭店　　　　　　　　|6|,3,*国际俱乐部饭店　　　　　|4|,3,*天伦王朝　　　　　　　　|3|,3,*嘉里中心　　　　　　　　|1|,3,*京伦饭店　　　　　　　　|2|,3,*希尔顿酒店　　　　　　　|18|,3,*京广新世界饭店　　　　　|20|,3,*昆仑饭店　　　　　　　　|21|,3,*新世纪饭店　　　　　　　|23|,3,*五洲大饭店　　　　　　　|24|,3,*渔阳饭店　　　　　　　　|25|,3,*王府井大饭店　　　　　　|26|,3,*东方花园饭店　　　　　　|27|,3,*宝辰饭店　　　　　　　　|28|,3,*京都信苑饭店　　　　　　|29|,3,*新侨饭店　　　　　　　　|30|,3,*国际饭店　　　　　　　　|31|,3,*新世界万怡　　　　　　　|32|,3,*新时代大酒店　　　　　　|35|,3,*亚洲锦江大酒店　　　　　|33|,3,*赛特饭店　　　　　　　　|36|,3,*丽都假日饭店　　　　　　|38|,3,*香山饭店　　　　　　　　|37|,3,*金台饭店　　　　　　　　|39|,3,*河南大厦　　　　　　　　|42|,3,*中旅大厦　　　　　　　　|41|,3,*新大都饭店　　　　　　　|40|,3,*华润饭店　　　　　　　　|43|,3,*亮马河大厦　　　　　　　|54|,3,*兆龙饭店　　　　　　　　|55|,3,*燕山饭店　　　　　　　　|56|,3,*中苑宾馆　　　　　　　　|57|,3,*越秀大饭店　　　　　　　|60|,3,*丰泽园饭店　　　　　　　|59|,3,*哈德门饭店　　　　　　　|58|,3,*奥林匹克饭店　　　　　　|61|,3,*鸿翔大厦　　　　　　　　|76|,3,*和平里大酒店　　　　　　|75|,3,*国门路大饭店　　　　　　|74|,3,*光明饭店　　　　　　　　|73|,3,*华都饭店　　　　　　　　|78|,3,*建银大厦　　　　　　　　|83|,3,*回龙观饭店　　　　　　　|82|,3,*黄河京都大酒店　　　　　|81|,3,*密云云湖度假村　　　　　|94|,3,*梅地亚宾馆　　　　　　　|93|,3,*侣松园酒店　　　　　　　|92|,3,*龙泉宾馆　　　　　　　　|91|,3,*奇然大酒店　　　　　　　|95|,3,*松鹤大酒店　　　　　　　|99|,3,*四环宾馆　　　　　　　　|98|,3,*神路圆大酒店　　　　　　|97|,3,*前门饭店　　　　　　　　|96|,3,*苏源锦江大厦　　　　　　|100|,3,*天桥酒店　　　　　　　　|103|,3,*泰山饭店　　　　　　　　|102|,3,*台湾饭店　　　　　　　　|101|,3,*天坛饭店　　　　　　　　|104|,3,*新兴宾馆　　　　　　　　|107|,3,*新侨饭店　　　　　　　　|106|,3,*燕京饭店　　　　　　　　|108|,3,*永安宾馆　　　　　　　　|110|,3,*中日青年交流中心　　　　|116|,3,*中国职工之家　　　　　　|115|,3,*远洋宾馆　　　　　　　　|113|,3,*竹园听松楼饭店　　　　　|119|,3,*仙人掌度假酒店　　　　　|398|,30,*南方大酒店　　　　　　　|391|,30,*凯莱度假酒店　　　　　　|386|,30,*山海天大酒店　　　　　　|393|,30,*国际大酒店　　　　　　　|388|,30,*天域度假酒店　　　　　　|387|,30,*海天大酒店　　　　　　　|389|,30,*南中国大酒店　　　　　　|392|,30,*明珠海景酒店　　　　　　|390|,30,*珠江花园饭店　　　　　　|395|,30,*东方大酒店　　　　　　　|396|,30,*金陵渡假村　　　　　　　|397|,30,*中亚大酒店　　　　　　　|394|,30,*明珠温泉酒店　　　　　　|663|,31,*金银岛大酒店　　　　　　|664|,31,*康乐园大酒店　　　　　　|662|,31,*国贸中心　　　　　　　　|566|,32,*河北宾馆　　　　　　　　|567|,32,*牡丹大酒店　　　　　　　|528|,33,*友谊宾馆　　　　　　　　|529|,33,*索菲特国际酒店　　　　　|611|,34,*中州假日宾馆　　　　　　|607|,34,*杜康大酒店　　　　　　　|608|,34,*红珊瑚酒店　　　　　　　|610|,34,*兴亚粤海温泉酒店　　　　|606|,34,*皇冠假日酒店　　　　　　|604|,34,*裕达国贸饭店　　　　　　|936|,34,*未来康年大酒店　　　　　|605|,34,*国际饭店　　　　　　　　|609|,34,*昆仑大酒店　　　　　　　|459|,35,*双鹤酒店　　　　　　　　|460|,35,*新世界北方酒店　　　　　|456|,35,*新加坡酒店　　　　　　　|455|,35,*融府康年酒店　　　　　　|457|,35,*松花江凯莱商务酒店　　　|461|,35,*香格里拉大饭店　　　　　|920|,35,*香格里拉大饭店　　　　　|919|,35,*国际饭店　　　　　　　　|917|,35,*万达假日酒店　　　　　　|458|,35,*金石大酒店　　　　　　　|345|,36,*帅府酒店　　　　　　　　|347|,36,*富苑假日酒店　　　　　　|342|,36,*江汉饭店　　　　　　　　|344|,36,*晴川假日酒店　　　　　　|346|,36,*湖滨花园酒店　　　　　　|343|,36,*长航大酒店　　　　　　　|340|,36,*璇宫大酒店　　　　　　　|348|,36,*东方大酒店　　　　　　　|332|,36,*香格里拉酒店　　　　　　|333|,36,*国宾大酒店　　　　　　　|335|,36,*白玫瑰酒店　　　　　　　|334|,36,*华美达酒店　　　　　　　|336|,36,*新世界万怡酒店　　　　　|338|,36,*天安假日酒店　　　　　　|337|,36,*亚洲大酒店　　　　　　　|339|,36,*长江大酒店　　　　　　　|341|,36,*小天鹅酒店　　　　　　　|422|,37,*富丽华大酒店　　　　　　|419|,37,*华天大酒店　　　　　　　|417|,37,*通程国际大酒店　　　　　|926|,37,*湘江宾馆　　　　　　　　|927|,37,*芙蓉宾馆　　　　　　　　|421|,37,*佳程酒店　　　　　　　　|420|,37,*神农大酒店　　　　　　　|418|,37,*华侨饭店　　　　　　　　|416|,38,*香格里拉大酒店　　　　　|412|,38,*长白山宾馆　　　　　　　|415|,38,*名门饭店　　　　　　　　|414|,38,*花园酒店　　　　　　　　|413|,38,*常州大酒店　　　　　　　|423|,39,*华侨大厦　　　　　　　　|452|,4,*闽江饭店　　　　　　　　|453|,4,*天福饭店　　　　　　　　|454|,4,*西湖大酒店　　　　　　　|449|,4,*黎明大酒店　　　　　　　|447|,4,*邦辉大酒店　　　　　　　|445|,4,*成龙国际大酒店　　　　　|446|,4,*外贸中心酒店　　　　　　|444|,4,*东方大酒店　　　　　　　|450|,4,*温泉大饭店　　　　　　　|448|,4,*东湖宾馆　　　　　　　　|451|,4,*云台宾馆　　　　　　　　|527|,40,*田园山庄　　　　　　　　|526|,40,*东方大酒店　　　　　　　|522|,40,*康平大酒店　　　　　　　|524|,40,*天然居宾馆　　　　　　　|525|,40,*黄海度假村　　　　　　　|523|,40,*山水大酒店　　　　　　　|267|,41,*中央大厦　　　　　　　　|268|,41,*白鹭饭店　　　　　　　　|262|,41,*虹桥饭店　　　　　　　　|263|,41,*南京饭店　　　　　　　　|265|,41,*状元楼酒店　　　　　　　|251|,41,*丁山花园宾馆　　　　　　|252|,41,*金鹰大酒店　　　　　　　|256|,41,*国际会议大酒店　　　　　|254|,41,*江苏新世纪大酒店　　　　|255|,41,*中山大厦　　　　　　　　|260|,41,*友好饭店　　　　　　　　|259|,41,*玄武饭店　　　　　　　　|257|,41,*怡华假日酒店　　　　　　|258|,41,*金陵饭店　　　　　　　　|248|,41,*希尔顿国际酒店　　　　　|250|,41,*金丝利喜来登酒店　　　　|249|,41,*古南都饭店　　　　　　　|253|,41,*金陵大厦　　　　　　　　|264|,41,*中心大酒店　　　　　　　|261|,41,*森信华侨大酒店　　　　　|266|,41,*天平大酒店　　　　　　　|565|,42,*华侨饭店　　　　　　　　|563|,42,*江南春宾馆　　　　　　　|564|,42,*苏州饭店　　　　　　　　|561|,42,*吴宫喜来登大酒店　　　　|558|,42,*雅都大酒店　　　　　　　|559|,42,*凯莱大酒店　　　　　　　|560|,42,*竹辉饭店　　　　　　　　|562|,42,*中旅大酒店　　　　　　　|627|,43,*新世界万怡酒店　　　　　|626|,43,*无锡大酒店　　　　　　　|622|,43,*新梁溪大酒店　　　　　　|623|,43,*锡州宾馆　　　　　　　　|625|,43,*华美达酒店　　　　　　　|618|,43,*喜来登大饭店　　　　　　|617|,43,*锦江大酒店　　　　　　　|619|,43,*美丽都酒店　　　　　　　|620|,43,*太湖花园酒店　　　　　　|621|,43,*碧波花园酒店　　　　　　|624|,43,*青山湖宾馆　　　　　　　|536|,44,*锦峰大酒店　　　　　　　|535|,44,*江西宾馆　　　　　　　　|534|,44,*凯莱大酒店　　　　　　　|532|,44,*五湖大酒店　　　　　　　|533|,44,*万达国际酒店　　　　　　|318|,45,*兴盛大酒店　　　　　　　|317|,45,*瑞士酒店　　　　　　　　|316|,45,*国际酒店　　　　　　　　|312|,45,*博览大酒店　　　　　　　|311|,45,*万达大酒店　　　　　　　|918|,45,*中诼建兴　　　　　　　　|916|,45,*二十一世纪　　　　　　　|915|,45,*心悦大酒店　　　　　　　|914|,45,*建国海景　　　　　　　　|875|,45,*渤海明珠大酒店　　　　　|307|,45,*富丽华大酒店　　　　　　|308|,45,*香格里拉大饭店　　　　　|310|,45,*海景酒店　　　　　　　　|309|,45,*九洲假日饭店　　　　　　|313|,45,*凯莱大酒店　　　　　　　|314|,45,*丽景大酒店　　　　　　　|315|,45,*丹东国际酒店　　　　　　|433|,46,*玫瑰大酒店　　　　　　　|278|,47,*香格里拉大酒店　　　　　|272|,47,*绿城凯莱商务酒店　　　　|277|,47,*新世界万怡酒店　　　　　|273|,47,*凯莱大酒店　　　　　　　|271|,47,*金都大酒店　　　　　　　|276|,47,*皇朝万豪大酒店　　　　　|270|,47,*高登　　　　　　　　　　|881|,47,*商贸饭店　　　　　　　　|269|,47,*金城酒店　　　　　　　　|275|,47,*凤凰大酒店　　　　　　　|274|,47,*昭君大酒店　　　　　　　|402|,48,*明湖酒店　　　　　　　　|492|,49,*玉泉森信大酒店　　　　　|489|,49,*贵友大酒店　　　　　　　|490|,49,*齐鲁宾馆　　　　　　　　|486|,49,*龙都酒店　　　　　　　　|485|,49,*润华世纪酒店　　　　　　|487|,49,*舜天大酒店　　　　　　　|488|,49,*良友富临酒店　　　　　　|491|,49,*珍珠大酒店　　　　　　　|493|,49,*武夷山庄　　　　　　　　|628|,5,*玉女大酒店　　　　　　　|629|,5,*黄金海岸大酒店　　　　　|580|,50,*华美达酒店　　　　　　　|578|,50,*环海凯莱商务酒店　　　　|579|,50,*黄海饭店　　　　　　　　|574|,50,*海景花园酒店　　　　　　|572|,50,*丽晶大酒店　　　　　　　|569|,50,*贵都酒店　　　　　　　　|571|,50,*海天大酒店　　　　　　　|568|,50,*香格里拉大饭店　　　　　|570|,50,*华天大酒店　　　　　　　|573|,50,*汇泉王朝大酒店　　　　　|575|,50,*青岛宾馆　　　　　　　　|576|,50,*华都大酒店　　　　　　　|577|,50,*太平洋大酒店　　　　　　|598|,51,*张裕大酒店　　　　　　　|600|,51,*亚细亚大酒店　　　　　　|599|,51,*山西大酒店　　　　　　　|590|,52,*钟楼饭店　　　　　　　　|644|,53,*秦都酒店　　　　　　　　|643|,53,*唐华宾馆　　　　　　　　|638|,53,*西安宾馆　　　　　　　　|639|,53,*城市酒店　　　　　　　　|640|,53,*长安城堡大酒店　　　　　|630|,53,*香格里拉金花饭店　　　　|634|,53,*凯悦（阿房宫）酒店　　　|632|,53,*达尔曼酒店　　　　　　　|631|,53,*喜来登大酒店　　　　　　|633|,53,*骊苑酒店　　　　　　　　|637|,53,*建国饭店　　　　　　　　|636|,53,*古都新世界大酒店　　　　|635|,53,*陇海大酒店　　　　　　　|642|,53,*唐城宾馆　　　　　　　　|641|,53,*新黄浦酒店公寓　　　　　|940|,54,*龙门宾馆　　　　　　　　|196|,54,*青松城大酒店　　　　　　|201|,54,*上海宾馆　　　　　　　　|203|,54,*三湘大厦　　　　　　　　|202|,54,*上海大厦　　　　　　　　|204|,54,*天鹤大酒店　　　　　　　|208|,54,*天鹅信谊宾馆　　　　　　|207|,54,*丝绸之路大饭店　　　　　|205|,54,*天马大酒店　　　　　　　|209|,54,*新苑宾馆　　　　　　　　|213|,54,*新亚大酒店　　　　　　　|212|,54,*新民大酒店　　　　　　　|211|,54,*物贸大厦　　　　　　　　|210|,54,*延安饭店　　　　　　　　|215|,54,*玉屏宾馆　　　　　　　　|218|,54,*扬子饭店　　　　　　　　|216|,54,*田林宾馆　　　　　　　　|226|,54,*浦东仁和　　　　　　　　|225|,54,*远东不夜城大酒店　　　　|219|,54,*金苑大酒店　　　　　　　|224|,54,*东亚饭店　　　　　　　　|222|,54,*兆安酒店　　　　　　　　|221|,54,*悦华大酒店　　　　　　　|220|,54,*吴宫大酒店　　　　　　　|227|,54,*仙霞宾馆　　　　　　　　|228|,54,*九龙宾馆　　　　　　　　|193|,54,*锦丽华大酒店　　　　　　|192|,54,*锦江饭店南楼　　　　　　|190|,54,*锦江青年会宾馆　　　　　|191|,54,*千鹤宾馆　　　　　　　　|200|,54,*南新亚大酒店　　　　　　|199|,54,*美丽园大酒店　　　　　　|198|,54,*绿州大厦　　　　　　　　|197|,54,*龙华迎宾馆　　　　　　　|195|,54,*白玉兰宾馆　　　　　　　|166|,54,*城市酒店　　　　　　　　|170|,54,*达华酒店　　　　　　　　|171|,54,*红楼宾馆　　　　　　　　|178|,54,*衡山宾馆　　　　　　　　|177|,54,*好望角酒店　　　　　　　|176|,54,*汉森酒店　　　　　　　　|175|,54,*江苏饭店　　　　　　　　|184|,54,*建工锦江大酒店　　　　　|183|,54,*衡山江假村　　　　　　　|946|,54,*王宝和大酒店　　　　　　|895|,54,*国际机场宾馆　　　　　　|174|,54,*航天大厦　　　　　　　　|223|,54,*鑫陇大酒店　　　　　　　|214|,54,*金沙江大酒店　　　　　　|189|,54,*光大会展中心国际大酒店　|172|,54,*日航龙柏饭店　　　　　　|890|,54,*中由日航　　　　　　　　|885|,54,*国际会议中心　　　　　　|884|,54,*银星皇冠酒店　　　　　　|131|,54,*锦江饭店北楼　　　　　　|143|,54,*和平汇中　　　　　　　　|140|,54,*和平饭店　　　　　　　　|139|,54,*富豪环球东亚酒店　　　　|120|,54,*浦东香格里拉大酒店　　　|121|,54,*波特曼丽思卡尔顿酒店　　|122|,54,*花园饭店　　　　　　　　|123|,54,*华亭宾馆　　　　　　　　|124|,54,*金茂凯悦大酒店　　　　　|125|,54,*锦沧文华大酒店　　　　　|126|,54,*静安希尔顿酒店　　　　　|127|,54,*威斯汀太平洋大酒店　　　|128|,54,*新锦江大酒店　　　　　　|129|,54,*新亚汤臣大酒店　　　　　|130|,54,*富豪外贸大酒店　　　　　|135|,54,*宝山宾馆　　　　　　　　|132|,54,*富豪东亚酒店　　　　　　|134|,54,*东方明珠空中旅馆　　　　|133|,54,*国际饭店　　　　　　　　|136|,54,*国际贵都大饭店　　　　　|137|,54,*海伦宾馆　　　　　　　　|138|,54,*虹桥宾馆　　　　　　　　|141|,54,*兰生大酒店　　　　　　　|145|,54,*华东大酒店　　　　　　　|142|,54,*静安宾馆　　　　　　　　|144|,54,*浦东假日　　　　　　　　|148|,54,*龙柏森林花园饭店　　　　|146|,54,*诺富特园林宾馆　　　　　|147|,54,*浦东通贸大酒店　　　　　|150|,54,*浦东紫金山　　　　　　　|151|,54,*世博会议大酒店　　　　　|156|,54,*建国宾馆　　　　　　　　|155|,54,*扬子江大酒店　　　　　　|160|,54,*新亚广场　　　　　　　　|159|,54,*万宝大酒店　　　　　　　|157|,54,*广场长城假日酒店　　　　|158|,54,*银河宾馆　　　　　　　　|161|,54,*远洋宾馆　　　　　　　　|163|,54,*由由大酒店　　　　　　　|162|,54,*宝隆宾馆　　　　　　　　|169|,54,*百乐门大酒店　　　　　　|168|,54,*奥林匹克俱乐部　　　　　|165|,54,*白玉兰滨海度假村　　　　|167|,54,*华夏宾馆　　　　　　　　|182|,54,*虹港大酒店　　　　　　　|179|,54,*华亭宾馆二号楼　　　　　|181|,54,*金桥大酒店　　　　　　　|188|,54,*金岛温莎酒店　　　　　　|185|,54,*金门大酒店　　　　　　　|187|,54,*金富运大酒店　　　　　　|186|,54,*蓝天宾馆　　　　　　　　|194|,54,*锦鑫宾馆　　　　　　　　|430|,55,*岷山饭店　　　　　　　　|429|,55,*总府皇冠假日酒店　　　　|426|,55,*银河王朝大酒店　　　　　|425|,55,*锦江宾馆　　　　　　　　|424|,55,*奥斯卡成都饭店　　　　　|428|,55,*安蓉酒店　　　　　　　　|427|,55,*曙都大厦　　　　　　　　|431|,55,*西藏饭店　　　　　　　　|432|,55,*金禧大酒店　　　　　　　|236|,56,*利顺德大饭店　　　　　　|234|,56,*帝城大酒店　　　　　　　|231|,56,*喜来登酒店　　　　　　　|230|,56,*凯悦饭店　　　　　　　　|229|,56,*假日饭店　　　　　　　　|232|,56,*津利华大酒店　　　　　　|233|,56,*凯撒皇宫大酒店　　　　　|237|,56,*水晶宫饭店　　　　　　　|235|,56,*假日酒店　　　　　　　　|519|,57,*拉萨饭店　　　　　　　　|520|,57,*丽晶酒店　　　　　　　　|805|,58,*日航酒店　　　　　　　　|806|,58,*万豪酒店　　　　　　　　|807|,58,*丽嘉酒店　　　　　　　　|804|,58,*君悦大酒店　　　　　　　|802|,58,*九龙香格里拉大酒店　　　|801|,58,*九龙酒店　　　　　　　　|800|,58,*海景嘉福酒店　　　　　　|797|,58,*喜来登酒店　　　　　　　|809|,58,*帝国酒店　　　　　　　　|836|,58,*卫兰轩酒店　　　　　　　|860|,58,*帝都酒店　　　　　　　　|815|,58,*马可勃罗酒店　　　　　　|849|,58,*帝京酒店　　　　　　　　|790|,58,*广旅宾馆　　　　　　　　|882|,58,*富豪九龙　　　　　　　　|880|,58,*丽东轩　　　　　　　　　|873|,58,*尖沙咀青年会酒店　　　　|871|,58,*北角海逸酒店　　　　　　|870|,58,*金域假日酒店　　　　　　|799|,58,*凯悦酒店　　　　　　　　|803|,58,*红勘海逸大酒店　　　　　|798|,58,*港岛太平洋酒店　　　　　|837|,58,*雅兰酒店　　　　　　　　|831|,58,*白英奇酒店　　　　　　　|868|,58,*粤华酒店　　　　　　　　|867|,58,*粤海酒店　　　　　　　　|866|,58,*伊荣阁酒店　　　　　　　|865|,58,*星港酒店　　　　　　　　|864|,58,*新雅图酒店　　　　　　　|863|,58,*新国泰酒店　　　　　　　|862|,58,*温莎酒店　　　　　　　　|861|,58,*伟晴轩酒店　　　　　　　|859|,58,*万年青酒店　　　　　　　|858|,58,*万丽海景酒店　　　　　　|857|,58,*湾景国际宾馆　　　　　　|856|,58,*仕德福酒店　　　　　　　|855|,58,*世纪海景酒店　　　　　　|854|,58,*山景仕德福酒店　　　　　|853|,58,*窝打老道青年会酒店　　　|852|,58,*明珠花园酒店　　　　　　|851|,58,*明珠海景酒店　　　　　　|850|,58,*龙堡国际酒店　　　　　　|848|,58,*利景酒店　　　　　　　　|847|,58,*丽东香港酒店　　　　　　|846|,58,*九龙悦来酒店　　　　　　|845|,58,*柏宁酒店　　　　　　　　|813|,58,*鹰君酒店　　　　　　　　|812|,58,*怡东酒店　　　　　　　　|811|,58,*香港酒店　　　　　　　　|810|,58,*文华东方酒店　　　　　　|808|,58,*港岛香格里拉大酒店　　　|795|,58,*港丽酒店　　　　　　　　|796|,58,*富丽华酒店　　　　　　　|794|,58,*富豪九龙酒店　　　　　　|792|,58,*康兰酒店　　　　　　　　|823|,58,*君怡酒店　　　　　　　　|822|,58,*京华国际酒店　　　　　　|821|,58,*黄金海岸酒店　　　　　　|820|,58,*皇悦酒店　　　　　　　　|819|,58,*宏基国际酒店　　　　　　|818|,58,*富豪启德酒店　　　　　　|817|,58,*帝苑酒店　　　　　　　　|816|,58,*城市花园酒店　　　　　　|814|,58,*英皇骏景酒店　　　　　　|833|,58,*逸东酒店　　　　　　　　|832|,58,*新世界万丽酒店　　　　　|830|,58,*太子酒店　　　　　　　　|829|,58,*世纪酒店　　　　　　　　|828|,58,*南洋酒店　　　　　　　　|827|,58,*美丽华大酒店　　　　　　|826|,58,*六国酒店　　　　　　　　|825|,58,*丽豪酒店　　　　　　　　|824|,58,*九龙丽东酒店　　　　　　|844|,58,*京港酒店　　　　　　　　|843|,58,*嘉怡海景酒店　　　　　　|842|,58,*皇家太平洋酒店　　　　　|841|,58,*华美酒店　　　　　　　　|840|,58,*华美达酒店　　　　　　　|839|,58,*恒丰酒店　　　　　　　　|838|,58,*大华酒店　　　　　　　　|835|,58,*百乐酒店　　　　　　　　|834|,58,*富豪机场酒店　　　　　　|791|,58,*富豪香港酒店　　　　　　|793|,58,*半岛酒店　　　　　　　　|789|,58,*环球大酒店　　　　　　　|597|,59,*假日大酒店　　　　　　　|595|,59,*海德酒店　　　　　　　　|594|,59,*银都大厦　　　　　　　　|596|,59,*美丽华大酒店　　　　　　|659|,6,*闽南大酒店　　　　　　　|660|,6,*丽轩酒店　　　　　　　　|661|,6,*绿晶酒店　　　　　　　　|658|,6,*龙都大酒店　　　　　　　|656|,6,*鹭江宾馆　　　　　　　　|657|,6,*京闽中心酒店　　　　　　|655|,6,*华闽酒店　　　　　　　　|652|,6,*华侨大厦　　　　　　　　|653|,6,*京华大酒店　　　　　　　|654|,6,*国际航空港大酒店　　　　|651|,6,*悦华酒店　　　　　　　　|649|,6,*东海酒店　　　　　　　　|650|,6,*厦门宾馆　　　　　　　　|648|,6,*马可勃罗东方大酒店　　　|646|,6,*东南亚大酒店　　　　　　|647|,6,*假日皇冠海景大酒店　　　|645|,6,*环球大酒店　　　　　　　|515|,60,*锦泰大酒店　　　　　　　|516|,60,*红房子温泉饭店　　　　　|514|,60,*樱花假日酒店　　　　　　|510|,60,*新城酒店　　　　　　　　|518|,60,*温莎七星大酒店　　　　　|517|,60,*中玉酒店　　　　　　　　|511|,60,*宝善大厦　　　　　　　　|512|,60,*金龙宾馆　　　　　　　　|505|,60,*威斯汀佳华酒店　　　　　|501|,60,*滇池温泉花园酒店　　　　|504|,60,*帝苑酒店　　　　　　　　|503|,60,*翠湖宾馆　　　　　　　　|502|,60,*锦华大酒店　　　　　　　|506|,60,*天恒酒店　　　　　　　　|508|,60,*昆明饭店　　　　　　　　|507|,60,*观光酒店　　　　　　　　|513|,60,*佳新大酒店　　　　　　　|948|,60,*万豪酒店　　　　　　　　|500|,60,*海逸酒店　　　　　　　　|499|,60,*邦克饭店　　　　　　　　|498|,60,*万怡酒店　　　　　　　　|509|,60,*五洋宾馆　　　　　　　　|481|,61,*西子宾馆　　　　　　　　|482|,61,*友好饭店　　　　　　　　|483|,61,*玉皇山庄　　　　　　　　|484|,61,*东方龙大酒店　　　　　　|462|,61,*世界贸易中心大饭店　　　|463|,61,*五洲大饭店　　　　　　　|464|,61,*国际假日酒店　　　　　　|467|,61,*香格里拉酒店　　　　　　|465|,61,*海华大酒店　　　　　　　|468|,61,*杭州之江度假村　　　　　|470|,61,*杭州大厦　　　　　　　　|469|,61,*杭州之江饭店　　　　　　|471|,61,*望湖宾馆　　　　　　　　|473|,61,*黄龙饭店　　　　　　　　|472|,61,*香溢大酒店　　　　　　　|474|,61,*华侨饭店　　　　　　　　|479|,61,*花港饭店　　　　　　　　|478|,61,*杭州湾大酒店　　　　　　|477|,61,*雷迪森广场酒店　　　　　|951|,61,*浙江饭店　　　　　　　　|950|,61,*浙江饭店　　　　　　　　|949|,61,*浙江大酒店　　　　　　　|947|,61,*浙江宾馆　　　　　　　　|476|,61,*新侨饭店　　　　　　　　|475|,61,*国际大厦　　　　　　　　|939|,61,*宋城大饭店　　　　　　　|480|,61,*甬港饭店　　　　　　　　|550|,62,*金龙饭店　　　　　　　　|548|,62,*华侨饭店　　　　　　　　|547|,62,*宁波饭店　　　　　　　　|549|,62,*中信国际大酒店　　　　　|543|,62,*新晶都酒店　　　　　　　|542|,62,*东港大酒店　　　　　　　|541|,62,*新园宾馆　　　　　　　　|545|,62,*宁波大酒店　　　　　　　|544|,62,*亚洲华园酒店　　　　　　|546|,62,*王朝大酒店　　　　　　　|592|,63,*国际大酒店　　　　　　　|591|,63,*华侨饭店　　　　　　　　|593|,63,*重庆饭店　　　　　　　　|362|,64,*金山酒店　　　　　　　　|357|,64,*海逸酒店　　　　　　　　|349|,64,*劲力大酒店　　　　　　　|353|,64,*万豪酒店　　　　　　　　|350|,64,*海德大酒店　　　　　　　|352|,64,*港天大酒店　　　　　　　|351|,64,*富安大酒店　　　　　　　|356|,64,*扬子江假日饭店　　　　　|359|,64,*人民宾馆　　　　　　　　|358|,64,*重庆宾馆　　　　　　　　|355|,64,*万友康年大酒店　　　　　|354|,64,*银河宾馆　　　　　　　　|360|,64,*重庆大酒店　　　　　　　|361|,64,*敦煌国际大酒店　　　　　|440|,7,*敦煌山庄　　　　　　　　|928|,7,*飞天大酒店　　　　　　　|521|,8,*君爵酒店　　　　　　　　|439|,9,*东莞山庄　　　　　　　　|438|,9,*华侨大酒店　　　　　　　|434|,9,*东方酒店　　　　　　　　|437|,9,*金凯悦酒店　　　　　　　|435|,9,*银城酒店　　　　　　　　|436|,9,");

var selectArray1 = new Array();
var selectArray2 = new Array();
var selectArray3 = new Array();
var selectArray4 = new Array();
var selectArray5 = new Array();
var selectArray6 = new Array();
var selectArray7 = new Array();
var selectArray8 = new Array();
var selectArray9 = new Array();
var selectArray10 = new Array();
var selectArray11 = new Array();
var selectArray12 = new Array();
var selectArray13 = new Array();
var selectArray14 = new Array();
var selectArray15 = new Array();
var selectArray16 = new Array();

function processReset()
{
	for(counter=1;counter<=16;counter++)
	{
		main=eval("document.myForm.select"+counter);
		child=eval("document.myForm.child"+counter);
		hotelname=eval("document.myForm.hotelname"+counter);
		main.selectedIndex=0;
		child.selectedIndex=0;
		hotelname.selectedIndex=0;
//		alert("["+main.selectedIndex+"]["+child.selectedIndex+"]["+hotelname.selectedIndex+"]")
		updateMenus(counter);
	}
	
}

function processUpdate()
{
	var i=0;
	var hotel;
	for(var counter=1;counter<=16;counter++)
	{
		hotel=eval("document.submitForm.hotelId"+counter);
    	selectHotel=eval("document.myForm.hotelname"+counter);
    	hotel.value=selectHotel.value;
	}
  	document.submitForm.method="POST";
  	document.submitForm.action="/cnhotel/servlet/com.dreamerland.cnhotelbooking.bst.CbstHotHotelUpdate";
	document.submitForm.submit();
	return false;
}


function clearOptions(counter)
{
//	for(var counter=1;counter<=16;counter++)
	{
		select=eval("selectArray"+counter);
		for(var i=1;i<select.length;i++)
		{
	                for(var j=0;j<select[i].length;j++)
	                {
	                        select[i].options[j].text="";
	                        select[i].options[j].value="";
	                }
		}
	}
}
function updateMenus (counter)
{

	clearOptions(counter);
//	for(var counter=1;counter<=16;counter++)
	{
		select=eval("selectArray"+counter);

		for ( var i=1 ; i <select.length;i++)
		{
	                var n = select[i-1].selectedIndex;
		        	var optionIndex =0;
	                var parentId=0;
	                var ancestryField;
	                var childfields = new String();
	                var childstr = new String();
	                var allParent;
	                var lengthCounter = 0;
	                parentId=select[i-1].options[n].value;
	                if(data[i]!=0)
	                {
	                  childstr = data[i].split("*")
	                  for ( var k=0; k<childstr.length;k++)
	                  {
	                        childfields = childstr[k].split("|");
	                        ancestryField = childfields[2];
	                        allParent = ancestryField.split(",");
	                        for (var j=0;j < allParent.length; j++)
	                        {
	                                if(parentId == allParent[j])
	                                {
	                                        lengthCounter += 1;
	                                        select[i].length += 1;
	                                        select[i].options[optionIndex].text=childfields[0];
	                                        select[i].options[optionIndex].value=childfields[1];
	                                        optionIndex+=1;
	                                }
	                        }
	                  }
	                 }
                

	                if(lengthCounter==0)
	                {
                          switch(i)
                          {
                            case 1:
                              select[i].options[optionIndex].text="　　　　　";break;
                            case 2:
                              select[i].options[optionIndex].text="　　　　　　　　　";break;
                            case 3:
	                            select[i].options[optionIndex].text="　　　　　　　　　　　　";break;
                          }
                          select[i].options[optionIndex].value=-1;
	                }
	                else
	                        select[i].length=lengthCounter;
		}
	}
}

function createMenus()
{
	str = data[0].split("*");
	var counter;
	var main,child,hotelname,select;
	for(counter=1;counter<=16;counter++)
	{
		main=eval("document.myForm.select"+counter);
		child=eval("document.myForm.child"+counter);
		hotelname=eval("document.myForm.hotelname"+counter);
		select=eval("selectArray"+counter);
		main.length = str.length;
		for ( var i=0; i < str.length; ++i)
		{
	                field = str[i].split("|");
	                main.options[i].text=field[0];
	                main.options[i].value=field[1];
		}
		main.length = str.length;
		select[0]=main;
		select[1]=child;
		select[2]=hotelname;
		for ( i=0;i<select.length;i++)
		{
	                select[i].selectedIndex = 0;
		}
		updateMenus(counter);
	}
	init();
}

// -->
</SCRIPT>

<SCRIPT language=javascript>
function init()
{
	var initvalue=new Array(
	
<jsp:include page="/servlet/com.dreamerland.cnhotelbooking.bst.CbstTop16Data" flush="true" />);

   	var str;
   	var value=new String();
  	for(var i=0;i<initvalue.length;i++)
   	{
   		main=eval("document.myForm.select"+(i+1));
		child=eval("document.myForm.child"+(i+1));
		hotelname=eval("document.myForm.hotelname"+(i+1));
   		str=initvalue[i];
  		value=str.split(",");
  		for(var j=0;j<main.length;j++)
  		{
  			if(value[0]==main.options[j].value)
  				main.options[j].selected=true;
  		}
   		updateMenus((i+1));
  		for(j=0;j<child.length;j++)
  		{
  			if(value[1]==child.options[j].value)
  				child.options[j].selected=true;
  		}
  		updateMenus((i+1));
  		for(j=0;j<hotelname.length;j++)
  		{
  			if(value[2]==hotelname.options[j].value)
  				hotelname.options[j].selected=true;
  		}
   		updateMenus((i+1));
   	}
}
</SCRIPT>

<META content="MSHTML 5.00.2614.3500" name=GENERATOR></HEAD>
<BODY bgColor=#ffffff onload=createMenus()>
<FORM name=myForm>
<TABLE border=1 borderColorDark=#ffffff borderColorLight=#f9c026 width=570>
  <TBODY>
  <TR>
    <TD class=font12 colSpan=4>精选酒店</TD></TR>
  <TR align=middle>
    <TD class=font12 width=50>1</TD>
    <TD width=120>
    	<SELECT name=select1 onchange=updateMenus(1)>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
    </TD>
    <TD width=200>
    	<SELECT name=child1 onchange=updateMenus(1)>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
    <TD width=200>
    	<SELECT name=hotelname1 onchange=updateMenus(1)>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
  </TR>
  <TR align=middle>
    <TD class=font12 width=50>2</TD>
    <TD width=120>
    	<SELECT name=select2 onchange=updateMenus(2)>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
    <TD width=200>
    	<SELECT name=child2 onchange=updateMenus(2)>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
    <TD width=200>
    	<SELECT name=hotelname2 onchange=updateMenus(2)>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
</TR>
  <TR align=middle>
    <TD class=font12 width=50>3</TD>
    <TD width=120>
    	<SELECT name=select3 onchange=updateMenus(3)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
    <TD width=200>
    	<SELECT name=child3 onchange=updateMenus(3)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
    <TD width=200>
    	<SELECT name=hotelname3 onchange=updateMenus(3)>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
   </TR>
  <TR align=middle>
    <TD class=font12 width=50>4</TD>
    <TD width=120>
    	<SELECT name=select4 onchange=updateMenus(4)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
    <TD width=200>
    	<SELECT name=child4 onchange=updateMenus(4)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
    <TD width=200>
    	<SELECT name=hotelname4 onchange=updateMenus(4)>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
    </TD>
   </TR>
  <TR align=middle>
    <TD class=font12 width=50>5</TD>
    <TD width=120>
    	<SELECT name=select5 onchange=updateMenus(5)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
    <TD width=200>
    	<SELECT name=child5 onchange=updateMenus(5)>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
    <TD width=200>
    	<SELECT name=hotelname5 onchange=updateMenus(5)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> 
   	</TD>
  </TR>
  <TR align=middle>
    <TD class=font12 width=50>6</TD>
    <TD width=120>
    	<SELECT name=select6 onchange=updateMenus(6)>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
    <TD width=200>
    	<SELECT name=child6 onchange=updateMenus(6)>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
   	</TD>
    <TD width=200>
    	<SELECT name=hotelname6 onchange=updateMenus(6)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
    </TD></TR>
  <TR align=middle>
    <TD class=font12 width=50>7</TD>
    <TD width=120>
    	<SELECT name=select7 onchange=updateMenus(7)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
    </TD>
    <TD width=200>
    	<SELECT name=child7 onchange=updateMenus(7)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT>
    </TD>
    <TD width=200>
    	<SELECT name=hotelname7 onchange=updateMenus(7)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD></TR>
  <TR align=middle>
    <TD class=font12 width=50>8</TD>
    <TD width=120>
    	<SELECT name=select8 onchange=updateMenus(8)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200>
    	<SELECT name=child8 onchange=updateMenus(8)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><B>
    	<SELECT name=hotelname8 onchange=updateMenus(8)> 
        <OPTION selected>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
        <OPTION selected>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
        <OPTION selected>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
        <OPTION selected>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
        </SELECT> 
  </B></TD></TR>
  <TR align=middle>
    <TD class=font12 width=50>9</TD>
    <TD width=120>
    	<SELECT name=select9 onchange=updateMenus(9)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200>
    	<SELECT name=child9 onchange=updateMenus(9)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200>
    	<SELECT name=hotelname9 onchange=updateMenus(9)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD></TR>
  <TR align=middle>
    <TD class=font12 width=50>10</TD>
    <TD width=120>
    	<SELECT name=select10 onchange=updateMenus(10)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=child10 onchange=updateMenus(10)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=hotelname10 onchange=updateMenus(10)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD></TR>
  <TR align=middle>
    <TD class=font12 width=50>11</TD>
    <TD width=120><SELECT name=select11 onchange=updateMenus(11)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=child11 onchange=updateMenus(11)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=hotelname11 onchange=updateMenus(11)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD></TR>
  <TR align=middle>
    <TD class=font12 width=50>12</TD>
    <TD width=120><SELECT name=select12 onchange=updateMenus(12)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=child12 onchange=updateMenus(12)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=hotelname12 onchange=updateMenus(12)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD></TR>
  <TR align=middle>
    <TD class=font12 width=50>13</TD>
    <TD width=120><SELECT name=select13 onchange=updateMenus(13)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=child13 onchange=updateMenus(13)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=hotelname13 onchange=updateMenus(13)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD></TR>
  <TR align=middle>
    <TD class=font12 width=50>14</TD>
    <TD width=120><SELECT name=select14 onchange=updateMenus(14)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=child14 onchange=updateMenus(14)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=hotelname14 onchange=updateMenus(14)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD></TR>
  <TR align=middle>
    <TD class=font12 width=50>15</TD>
    <TD width=120><SELECT name=select15 onchange=updateMenus(15)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=child15 onchange=updateMenus(15)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=hotelname15 onchange=updateMenus(15)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD></TR>
  <TR>
    <TD class=font12 colSpan=4>热门酒店</TD></TR>
  <TR align=middle>
    <TD class=font12 width=50>1</TD>
    <TD width=120><SELECT name=select16 onchange=updateMenus(16)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=child16 onchange=updateMenus(16)>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD>
    <TD width=200><SELECT name=hotelname16 onchange=updateMenus(16)> 
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	<OPTION >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</OPTION>
    	</SELECT> </TD></TR>
  <TR align=middle>
    <TD colSpan=4>
	<a href="javascript:processUpdate();"><IMG height=26 src="/images/botton_update.gif" width=68 border=0></a>
	<IMG height=1  src="/images/dot.gif" width=90 border=0>
	<a href="javascript:processReset();">
		<IMG height=26 src="/images/botton_restore.gif" width=68 border=0>
	</a>
    </TD>
  </TR>
</TBODY>
</TABLE>
</FORM>
<FORM name=submitForm><INPUT name=hotelId1 type=hidden> <INPUT name=hotelId2 
type=hidden> <INPUT name=hotelId3 type=hidden> <INPUT name=hotelId4 type=hidden> 
<INPUT name=hotelId5 type=hidden> <INPUT name=hotelId6 type=hidden> <INPUT 
name=hotelId7 type=hidden> <INPUT name=hotelId8 type=hidden> <INPUT 
name=hotelId9 type=hidden> <INPUT name=hotelId10 type=hidden> <INPUT 
name=hotelId11 type=hidden> <INPUT name=hotelId12 type=hidden> <INPUT 
name=hotelId13 type=hidden> <INPUT name=hotelId14 type=hidden> <INPUT 
name=hotelId15 type=hidden> <INPUT name=hotelId16 type=hidden> 
</FORM></BODY></HTML>
